32 100
117 101
101 110
32 108
101 115
32 97
113 257
111 115
32 115
101 114
32 99
256 101
32 112
32 262
97 110
32 121
97 115
32 109
111 110
97 114
111 114
32 116
100 111
195 173
101 108
32 104
32 258
259 97
32 110
97 108
32 118
97 98
32 260
195 179
32 280
99 105
114 97
116 101
117 110
114 101
264 101
105 110
97 100
195 161
195 169
226 128
301 148
116 111
99 104
284 111
266 274
117 105
13 10
264 117
308 13
100 105
111 109
116 97
279 97
268 276
106 111
32 98
261 108
32 111
259 263
108 97
105 258
105 115
195 177
32 102
259 101
108 101
100 101
257 115
116 114
32 294
256 105
304 111
259 111
265 111
103 111
256 274
259 272
97 109
116 105
266 117
100 97
266 312
273 101
281 97
268 275
32 83
256 260
114 260
114 105
99 101
267 108
299 115
32 103
277 111
113 307
264 105
108 111
288 116
273 105
289 110
81 307
265 97
362 316
347 270
364 293
270 278
281 287
287 97
114 111
116 292
111 108
343 111
117 115
97 278
32 302
115 101
32 366
365 333
32 356
99 117
285 108
100 263
109 111
273 353
122 97
118 105
32 295
277 270
273 117
100 298
258 116
324 276
101 109
264 297
271 111
257 110
266 287
264 265
32 68
99 111
105 114
296 393
116 260
298 97
109 101
32 194
257 114
99 265
300 108
105 265
113 117
99 97
112 274
103 294
330 111
98 295
105 103
277 258
286 265
109 97
32 80
268 111
311 289
299 110
284 105
105 111
346 97
349 414
261 110
108 263
264 111
116 258
195 186
261 115
116 263
331 97
273 270
258 293
32 65
116 275
300 110
32 410
315 262
286 329
309 115
262 108
114 270
276 97
291 97
99 260
108 272
351 100
270 293
116 117
32 114
261 447
429 424
32 67
100 272
109 263
32 106
302 44
260 101
355 278
116 272
317 397
286 105
259 327
273 265
263 111
325 257
398 382
286 258
115 105
261 99
32 297
279 270
105 98
268 329
266 272
368 314
291 361
311 316
288 112
114 272
317 322
266 263
288 303
32 77
112 111
32 89
103 275
407 191
470 453
32 76
109 105
103 97
100 265
268 272
281 101
281 105
117 292
341 285
105 97
273 285
332 316
32 69
435 279
116 276
100 260
116 298
346 101
110 111
32 101
275 97
266 97
108 105
291 111
261 114
98 105
282 116
103 117
277 117
297 111
32 84
412 300
273 279
256 117
112 97
322 278
277 101
354 448
355 383
291 114
274 260
286 101
122 111
264 287
445 371
264 285
109 112
288 313
300 115
99 274
268 265
287 270
261 294
115 111
268 114
304 97
265 263
32 363
268 335
273 323
291 110
273 258
105 263
267 106
118 111
271 97
99 270
261 100
275 274
118 265
268 257
32 105
318 415
112 101
434 110
322 303
277 292
267 535
395 111
341 367
256 263
330 272
100 114
116 265
268 258
286 372
345 409
273 97
330 263
256 275
100 258
265 274
268 105
116 289
99 275
106 263
292 122
407 161
266 276
298 263
288 293
270 386
118 101
277 285
345 121
380 258
266 339
99 258
268 370
337 328
258 278
261 112
109 270
78 111
99 314
100 275
420 391
412 279
264 97
277 322
32 527
99 272
281 117
350 109
290 321
114 263
32 82
288 381
117 108
268 97
103 570
264 274
256 323
390 121
268 101
105 108
267 98
313 278
281 265
276 260
281 272
473 335
32 263
105 278
273 111
116 270
400 558
522 295
32 336
319 371
548 262
324 97
99 312
403 97
261 109
279 272
286 323
266 275
106 101
115 117
319 416
109 439
430 100
257 108
265 110
277 105
268 274
318 108
265 101
268 117
101 103
102 105
469 118
359 299
106 97
324 111
259 117
259 321
261 613
114 323
272 101
297 97
108 275
284 263
317 97
266 105
394 112
432 417
108 270
359 369
284 329
257 336
259 479
294 278
279 110
118 392
580 115
273 260
103 292
325 408
98 97
106 265
488 97
270 404
261 104
112 275
112 276
268 295
529 262
300 323
108 260
286 285
32 609
390 304
115 97
268 285
99 289
280 111
389 303
114 275
281 312
99 263
32 70
663 279
101 97
298 276
286 111
298 272
264 300
32 66
277 312
298 295
98 411
419 336
32 592
276 111
99 295
98 292
99 280
304 101
281 382
469 103
270 97
339 263
273 689
122 272
317 275
118 258
118 97
105 361
121 111
99 287
109 258
423 401
266 397
39 39
325 297
636 313
32 86
278 327
109 272
615 101
355 342
568 97
383 101
100 314
286 392
258 450
332 333
109 571
394 491
99 350
281 270
294 303
557 263
112 265
323 510
488 272
324 272
121 97
467 97
268 349
112 105
340 108
346 293
348 101
259 105
672 493
285 260
259 260
468 342
266 111
101 386
331 111
355 460
422 597
259 687
497 336
368 265
268 619
344 106
306 111
299 114
32 370
419 314
481 97
100 274
100 289
117 114
567 542
264 372
266 295
112 518
341 292
32 265
432 121
270 303
291 606
114 314
319 279
112 117
105 342
661 766
438 363
408 293
622 111
394 263
282 433
457 321
32 349
325 285
440 110
105 391
342 278
277 411
194 187
256 111
624 556
261 98
634 461
261 384
833 720
279 475
700 449
260 340
275 377
284 297
291 289
332 111
284 97
438 111
300 114
32 71
100 335
109 417
281 772
109 353
480 303
796 276
32 350
104 97
284 257
264 279
566 328
32 276
108 321
319 591
286 97
390 333
291 272
508 115
311 278
116 285
339 439
390 697
118 270
282 562
264 257
112 258
260 97
290 431
319 577
105 101
673 109
266 270
652 303
374 111
277 114
122 361
523 97
308 308
100 276
256 314
291 278
98 660
318 626
319 584
115 280
472 292
98 275
261 691
288 111
485 265
98 349
285 358
312 101
270 111
430 404
526 111
539 265
105 289
830 292
354 374
100 280
400 837
533 328
296 97
419 265
102 101
286 427
116 295
473 552
115 274
105 336
716 417
284 101
282 330
98 114
332 336
291 112
711 287
354 292
112 329
32 72
115 279
32 544
521 442
268 727
277 434
99 276
317 374
501 333
266 289
285 657
476 287
108 258
32 458
288 767
261 793
368 478
322 436
588 101
260 258
644 890
256 651
681 713
109 276
421 103
438 263
258 122
508 110
380 335
289 358
742 98
325 329
311 111
354 117
473 265
462 117
277 394
842 415
602 525
513 351
266 408
339 97
851 505
359 272
411 274
502 538
277 349
423 578
325 97
550 297
808 712
513 409
98 111
103 307
750 313
390 551
703 415
281 275
665 311
530 324
709 272
623 849
256 97
277 339
422 329
108 418
104 287
112 516
297 263
422 335
324 263
108 276
317 111
581 387
294 97
392 260
291 263
583 121
273 275
425 760
32 402
101 122
628 732
268 769
263 479
662 265
556 454
399 299
496 111
266 265
302 59
348 313
399 387
359 117
109 117
279 455
106 272
319 98
343 955
269 114
274 328
559 275
332 351
100 117
325 276
398 788
273 274
442 755
360 108
816 544
256 257
341 812
295 979
693 384
748 303
266 405
268 260
400 101
305 735
116 369
280 97
567 953
675 340
337 734
103 270
286 263
1024 358
69 110
730 536
537 451
299 323
938 384
291 536
686 416
304 263
122 275
322 101
281 274
112 272
347 101
112 295
445 97
908 303
102 295
268 280
32 479
102 276
490 270
32 429
109 402
273 276
648 111
261 694
492 111
110 263
266 350
359 275
112 263
359 263
960 101
329 371
632 101
821 1015
332 813
962 275
392 263
102 265
273 263
537 122
279 115
103 289
382 335
709 263
433 303
326 871
456 263
98 350
340 114
528 111
117 300
704 710
423 761
546 918
422 276
116 323
658 454
398 900
992 932
287 327
459 275
97 416
722 122
266 411
280 454
114 117
294 512
269 100
515 304
322 293
266 1051
285 321
101 100
810 270
309 351
110 97
279 278
795 335
115 263
311 97
292 278
261 103
118 272
380 442
265 272
529 342
117 486
441 427
949 721
1013 327
555 384
325 101
286 659
517 374
98 471
779 358
98 402
348 381
304 272
348 328
267 99
425 278
456 117
264 270
302 46
277 276
279 111
108 327
978 925
267 610
297 275
401 103
557 260
388 121
108 299
348 1038
105 321
524 387
266 285
319 121
264 958
474 313
339 571
305 850
306 116
274 451
105 109
256 375
959 335
860 586
508 108
359 547
306 102
502 291
581 565
640 278
294 413
284 405
357 278
306 115
455 114
304 631
682 295
264 258
81 1108
112 1055
1076 551
103 258
105 100
69 115
339 276
106 275
381 114
345 351
273 272
98 101
477 102
108 265
690 655
608 111
318 421
372 276
476 312
563 1122
360 114
455 292
32 751
896 503
502 670
459 339
904 1152
261 117
282 371
339 101
380 549
286 840
319 1072
296 626
32 394
347 105
520 756
354 439
105 272
581 1124
298 878
306 371
440 108
258 303
99 375
1006 276
781 111
317 684
340 289
425 755
406 106
418 117
309 451
339 353
730 361
457 431
423 499
101 291
318 562
471 584
341 1119
449 884
702 262
268 322
99 339
658 699
277 486
299 98
273 408
618 521
118 323
1227 1174
823 499
116 405
83 270
344 952
273 314
1104 416
440 930
737 289
114 300
32 374
118 372
660 367
893 384
1074 97
504 260
607 275
103 272
108 117
599 260
1170 579
297 105
469 493
1096 330
348 97
308 310
268 882
1068 393
442 278
280 321
762 503
348 293
285 97
67 97
332 106
109 265
389 313
459 274
122 263
695 274
116 367
258 97
445 416
688 621
550 263
442 760
32 1216
615 258
1017 1145
264 820
118 314
650 276
268 408
354 258
456 258
403 260
114 299
1111 97
109 275
433 483
969 491
568 111
112 280
286 525
266 1263
270 263
835 97
81 257
331 263
326 121
838 384
356 363
311 114
109 98
462 374
340 278
827 1286
287 358
474 314
926 292
668 275
686 371
32 292
115 411
380 475
1139 449
966 97
261 999
1052 321
359 295
118 263
264 263
462 1255
114 258
883 369
886 1298
284 1194
588 260
273 820
726 275
112 349
1306 1203
496 97
46 46
117 100
579 109
103 285
722 451
873 358
332 603
256 410
293 97
963 314
256 300
259 258
268 350
277 374
32 682
675 293
110 105
688 265
524 560
261 523
102 97
261 121
718 1285
117 391
782 603
103 263
311 483
506 97
500 275
644 728
357 1200
284 1242
289 377
322 404
115 265
418 263
318 336
381 292
936 590
32 425
360 512
275 427
348 258
521 289
1027 289
541 402
1276 333
1277 505
520 370
118 276
481 111
550 901
259 941
604 112
380 664
32 195
815 278
340 450
280 105
522 1183
269 803
341 542
1151 97
270 100
290 452
103 375
263 97
481 1153
317 804
68 101
283 733
339 946
1229 510
354 285
109 375
695 386
1121 303
418 503
318 666
282 394
306 475
104 105
273 372
32 78
281 111
265 471
1198 285
102 258
1199 1215
268 321
736 275
731 1384
926 486
101 313
340 560
604 102
423 417
533 511
296 324
109 274
274 377
105 295
275 105
539 101
341 425
600 97
345 610
1073 418
515 120
1160 519
762 335
368 678
921 451
267 1378
299 103
872 512
268 1147
361 328
388 406
359 425
681 1399
688 370
667 519
256 276
1066 292
98 358
266 280
399 314
79 104
319 617
751 46
298 635
607 263
268 374
100 285
260 313
108 452
103 257
524 114
325 970
97 447
1001 413
496 101
261 409
485 97
334 401
286 402
307 519
343 101
69 108
317 272
392 275
288 101
268 297
281 449
380 441
632 314
1319 321
481 105
282 1208
286 531
857 560
1130 370
290 358
474 402
352 454
377 393
455 100
568 263
258 272
256 258
580 97
118 260
104 449
306 1102
288 340
1387 885
267 852
343 988
400 1467
261 381
325 105
586 427
99 478
462 769
32 90
343 265
341 270
380 1356
500 510
1002 289
265 292
680 1464
389 466
530 647
556 342
100 270
1026 994
619 272
98 372
368 705
266 678
485 405
374 1571
563 497
835 503
32 362
412 410
368 108
418 307
348 694
1405 514
388 291
388 351
288 99
311 765
118 275
256 369
1505 745
266 372
296 1252
592 263
1270 303
354 270
339 471
269 611
282 498
716 899
1415 105
566 278
845 1462
422 1538
513 843
302 58
273 516
922 275
352 321
121 606
566 1501
98 272
101 409
102 257
502 316
1069 415
112 370
277 275
515 914
32 79
268 294
344 961
284 1261
477 115
462 294
269 814
287 1100
838 421
346 404
261 538
321 278
264 392
109 285
33 44
380 265
489 121
116 280
97 117
261 102
665 278
32 731
265 875
563 1029
261 916
264 531
348 311
357 114
281 536
543 278
807 111
692 275
323 384
32 73
389 436
457 358
594 114
1172 340
99 367
499 263
106 260
995 314
467 263
116 274
614 590
32 74
513 610
1308 453
281 1129
313 657
317 292
634 1217
433 265
421 121
282 387
343 112
105 99
539 314
747 382
194 161
432 321
391 260
432 358
652 313
331 272
456 312
868 321
101 351
109 260
697 291
500 111
457 452
288 97
931 293
604 598
277 265
477 1332
614 1113
977 1425
467 272
490 105
259 1490
1118 1558
928 303
352 431
1265 549
496 1579
256 297
291 1036
324 738
618 981
467 111
115 285
332 103
594 404
747 1100
653 313
354 418
306 377
309 746
1704 1574
286 1065
98 327
359 292
325 1600
104 101
966 111
260 381
67 274
297 939
677 483
121 272
105 383
268 298
847 109
418 110
99 397
459 1630
628 1210
517 117
261 1583
623 304
116 454
98 265
275 300
122 299
99 285
987 363
1155 1105
874 115
398 111
291 763
502 1510
1508 1245
387 114
296 323
265 461
268 1660
311 587
109 946
266 297
291 765
99 279
526 1645
795 363
311 464
256 367
466 101
614 884
32 88
97 316
640 538
102 285
115 374
259 275
277 370
630 333
332 1350
329 577
1431 137
423 100
430 611
1393 512
307 278
566 586
354 738
691 503
350 108
291 108
106 289
332 587
508 549
976 314
878 336
280 431
116 297
565 391
896 1144
750 303
306 441
318 122
324 298
306 793
257 358
802 328
272 258
319 108
291 375
103 448
477 1205
707 276
341 775
515 1692
100 369
666 375
815 114
317 1597
449 817
116 1003
285 460
873 327
282 291
445 577
462 1523
387 278
115 361
563 1078
559 289
323 97
266 307
105 887
1489 297
693 421
261 570
673 608
118 1089
381 108
368 531
346 340
541 906
261 421
1022 387
263 262
568 272
1397 117
684 111
512 263
1236 98
1367 316
264 659
572 314
1132 424
32 34
296 415
281 276
1357 363
256 279
277 295
523 272
583 1712
258 342
386 774
692 1447
400 105
1483 370
941 519
1474 285
856 409
116 425
288 330
857 1140
781 263
1254 263
1271 363
435 1184
274 293
112 114
105 460
782 542
341 108
110 101
500 289
304 375
435 514
680 1689
285 415
277 1391
357 103
256 1219
340 391
1610 387
555 421
1220 988
348 569
1007 639
607 1545
1325 313
116 547
985 589
98 397
566 342
365 1828
299 108
268 263
602 491
111 104
1081 328
105 464
518 391
810 260
931 313
265 270
317 258
296 270
632 1773
1220 111
1018 413
122 401
260 771
266 382
73 73
855 401
328 97
826 313
100 292
1460 121
99 303
291 342
261 885
110 117
296 112
736 289
268 411
663 299
827 1666
103 295
99 369
360 715
798 1575
264 312
520 350
117 122
1206 449
446 874
1039 647
326 265
1021 114
32 386
105 401
118 285
259 1000
317 295
725 322
99 108
32 1340
291 1094
782 417
381 367
194 191
628 996
832 647
322 450
334 1413
432 923
256 664
112 335
259 418
280 101
277 1737
296 523
976 299
360 292
322 258
692 1180
866 1570
1050 297
356 265
1400 450
101 98
1084 375
805 276
372 117
1446 887
1561 1820
307 114
1563 436
1077 499
350 278
100 464
275 406
544 569
928 313
1081 387
686 584
311 115
110 260
459 117
368 105
419 498
441 274
1254 111
274 97
963 651
490 272
98 322
270 741
84 111
121 263
273 727
287 706
631 427
272 111
260 303
472 295
317 274
823 1591
32 1253
388 102
268 270
284 666
1673 538
109 298
100 279
311 303
1494 961
807 265
986 300
495 260
292 383
1388 875
311 342
345 603
476 276
726 289
455 387
707 1461
1011 303
586 450
400 274
1755 336
122 413
572 313
904 278
121 289
112 297
267 1463
1619 589
418 97
921 336
728 303
357 982
261 433
327 386
777 303
345 498
380 1748
291 471
1586 450
257 744
398 114
306 1402
1128 902
115 297
1520 519
387 289
104 117
1596 699
497 108
101 316
392 258
285 327
1113 1945
419 578
557 340
275 100
32 1941
116 300
312 417
430 293
433 314
964 122
476 408
474 478
339 417
348 99
377 324
329 416
325 402
285 101
276 110
326 1134
260 112
486 401
1376 46
602 297
834 350
1163 110
879 275
898 275
922 289
317 280
1191 587
476 901
282 409
460 101
97 294
672 122
325 739
388 525
330 505
1604 384
940 275
109 405
345 336
1052 452
281 822
359 367
347 279
357 861
1937 427
106 117
618 1993
622 101
98 518
964 1043
1984 483
515 391
419 478
1736 349
490 274
295 406
303 278
114 425
1585 289
630 262
357 1868
1166 427
296 732
108 402
517 265
261 106
1882 530
419 639
644 108
109 1094
276 295
797 409
1266 297
325 117
1471 260
272 279
1028 814
319 733
430 340
297 272
1161 1938
1522 1543
1118 2095
274 327
563 565
965 276
269 342
115 287
277 448
105 542
305 1433
80 276
537 111
261 374
1564 101
270 272
583 464
115 293
485 1822
834 592
356 442
392 295
1633 404
382 275
261 569
356 258
434 108
546 499
298 117
309 775
328 535
108 516
1488 828
297 260
345 1864
625 122
1045 275
400 279
623 1662
927 865
110 272
1738 276
982 114
99 595
1455 919
263 263
650 1411
1006 635
258 562
317 1302
1084 595
879 369
297 293
1028 265
286 297
411 101
625 1335
1499 1078
325 1453
1033 1821
1128 1338
76 327
500 375
273 1781
347 117
286 1294
104 772
712 384
707 1127
502 591
978 451
258 865
1741 549
100 1168
101 278
344 311
1233 278
1535 375
108 363
911 386
1602 324
959 272
32 40
261 116
1244 2074
332 1010
318 313
692 369
261 1804
537 97
512 272
511 97
991 671
594 295
318 1925
266 258
291 1863
517 778
1697 333
112 402
265 285
391 263
112 260
293 386
282 381
103 195
341 746
899 285
388 1373
259 597
300 377
261 1272
332 464
1307 464
555 265
311 606
1710 552
345 813
883 117
286 973
388 1169
381 285
1966 677
115 272
673 421
1671 278
825 2128
118 531
541 1377
265 869
272 313
332 1095
1641 321
344 1137
332 498
1112 262
1327 1817
362 442
423 1469
303 383
306 330
295 461
1093 611
438 803
105 328
99 405
474 498
1026 486
400 919
404 997
272 2013
490 275
500 369
109 899
357 542
1260 122
332 654
832 121
485 471
1022 311
1554 314
277 97
282 111
842 626
420 328
815 383
625 493
261 696
1175 464
1033 122
475 303
256 265
1428 111
354 442
1852 258
273 257
1011 483
317 114
1456 336
857 744
481 340
579 505
1491 635
105 291
578 299
490 97
266 101
1703 292
317 276
615 260
104 274
1720 454
492 97
330 117
261 1477
1166 285
388 784
1214 1294
1933 624
472 336
572 265
1760 413
549 417
109 733
2108 262
325 1434
1126 275
2184 340
286 270
99 510
604 381
317 260
700 279
103 276
2228 97
695 293
291 587
299 521
100 363
515 106
354 307
630 1345
289 327
348 466
476 2014
1271 464
653 370
456 1831
798 1476
116 335
1815 519
432 323
485 270
289 2328
114 265
341 298
116 299
1400 1810
118 659
1125 564
880 115
330 260
585 327
98 731
281 2086
1222 367
104 1759
1103 441
1546 416
1079 263
625 654
546 655
101 111
1638 260
1681 552
893 101
114 659
68 1029
115 525
1022 560
332 994
434 2126
1832 829
292 483
359 300
32 2365
943 1154
326 577
65 108
872 633
326 591
777 439
368 1329
1295 274
282 590
271 265
491 401
537 2210
407 171
430 930
1617 292
371 278
340 111
585 300
682 263
493 274
496 327
870 260
440 2024
752 939
826 441
695 741
1437 2141
304 275
348 436
109 323
265 721
480 313
321 103
283 278
572 101
476 1878
418 257
420 1136
289 384
360 2232
940 289
309 808
105 413
1577 111
277 350
2186 850
521 278
533 100
256 270
680 106
1230 1346
1039 774
261 608
754 258
279 1513
1824 421
322 342
97 654
348 1932
274 375
103 280
98 1944
270 450
725 2308
67 2462
488 455
474 889
80 335
388 103
279 514
2084 278
116 1065
2047 745
559 367
108 479
1809 387
101 293
350 97
258 111
259 677
621 97
319 1498
112 285
831 302
291 265
2051 519
309 1154
490 1478
388 677
1000 505
423 413
895 342
496 263
432 935
100 361
2132 2307
1074 270
607 370
1158 678
340 342
485 1442
474 103
332 1711
500 97
585 406
1021 278
650 635
545 111
653 336
291 383
292 342
387 265
388 112
266 2061
486 101
400 1029
718 1732
1132 867
260 293
722 121
275 101
470 101
434 475
468 108
456 1786
388 1095
325 321
1177 289
323 512
1158 1098
268 372
618 2070
394 101
608 263
32 85
355 413
898 367
1182 297
262 115
286 571
578 2478
2564 122
323 293
341 275
1668 117
311 1512
115 372
390 114
618 728
632 258
1446 100
288 545
2124 100
67 117
821 262
105 122
777 763
274 1049
306 589
1812 427
718 1453
752 103
408 292
277 402
1035 313
873 671
325 114
612 363
1150 303
453 265
695 270
664 386
559 375
693 97
821 2565
413 303
641 404
1877 1655
476 299
2062 335
977 291
797 889
758 1323
1790 108
1159 406
313 483
388 1379
1622 303
1622 1929
1260 1064
317 101
578 314
114 289
345 2254
872 313
440 114
118 544
309 491
1326 779
312 97
1509 973
103 1231
459 321
1455 1411
260 272
1721 316
286 272
1763 401
260 111
295 415
825 1994
2331 335
100 478
337 97
102 350
414 265
332 1282
280 263
105 765
805 265
1111 272
101 303
1444 321
539 427
2446 1098
2017 391
273 731
273 1089
98 621
288 272
550 312
403 272
501 1063
1429 2391
289 115
353 340
1857 272
1362 384
777 1004
943 303
412 297
1518 2581
631 321
332 451
1971 525
1201 340
1700 1396
1691 384
938 2236
100 374
630 276
339 272
273 2546
105 386
319 2496
296 530
306 433
1742 1470
565 1253
614 99
261 671
339 111
522 531
256 1493
350 1775
340 766
825 569
420 299
266 322
339 923
539 260
318 2515
319 381
387 342
108 367
307 115
1035 111
1347 1433
281 372
650 275
583 260
102 408
737 367
32 2199
1388 384
1326 2258
440 1549
526 1391
608 97
354 2586
438 100
97 121
648 258
1039 671
423 717
350 98
614 712
106 375
98 374
668 289
960 258
306 409
798 109
500 564
641 450
105 303
261 328
701 101
280 384
325 307
279 263
476 263
607 350
658 369
1638 258
354 275
381 678
381 486
2409 298
1291 493
348 771
462 2077
400 1796
311 383
1621 328
430 342
99 721
316 327
468 560
1772 88
474 639
2078 260
345 450
282 2150
1494 311
265 314
99 363
684 97
686 577
270 313
445 584
118 297
294 111
1190 402
306 633
550 690
1717 314
477 743
273 312
291 100
114 361
295 511
112 257
99 294
476 295
462 503
361 919
528 272
485 1259
277 274
1454 295
101 466
552 263
354 2513
987 464
707 392
318 303
1943 696
1045 2469
594 293
1651 1892
2103 2055
118 525
668 369
725 1845
388 285
608 363
101 336
668 97
319 1833
893 97
432 2265
578 300
2224 505
1177 587
105 536
332 565
1437 518
296 774
1777 336
711 97
99 298
1514 98
68 558
420 272
277 682
1888 97
1342 260
325 299
476 369
322 460
259 279
325 270
105 471
805 349
943 98
1050 1733
354 272
330 353
1589 1154
1962 404
344 122
348 112
354 97
583 441
468 1757
112 619
111 416
499 1010
588 424
382 272
275 327
879 375
398 1797
266 2414
612 335
704 115
701 293
985 441
588 328
287 292
667 1839
706 505
1249 401
32 882
68 274
977 340
278 384
282 1095
2325 316
388 2485
787 103
1190 374
1856 342
567 497
1951 293
103 374
851 1240
641 303
455 560
68 837
481 1640
598 391
500 101
650 2552
103 367
529 108
1590 374
863 775
898 597
260 466
1890 431
105 1036
520 1450
1659 265
433 450
2019 285
456 280
118 1065
1159 321
623 383
795 265
1811 328
266 1123
456 257
1079 402
1803 289
260 1048
805 1147
1582 2339
118 280
111 121
281 2375
266 1282
32 117
101 741
2525 597
691 1144
1233 383
270 342
280 270
880 2780
277 840
299 321
271 2732
355 590
32 2664
326 371
468 2481
102 111
743 314
256 970
506 263
265 258
1742 340
1627 1745
1231 293
1390 2454
441 377
2745 690
346 275
288 1169
796 635
1995 111
109 335
280 452
446 2257
1418 562
438 351
654 381
1347 303
500 263
611 377
256 1409
266 659
650 1314
279 114
109 689
1393 285
111 371
468 2071
771 1964
797 1920
541 97
98 370
329 101
1175 587
103 369
360 2456
1219 817
970 333
106 405
258 313
260 767
32 81
2503 654
392 289
288 263
116 1008
318 287
345 1559
359 276
528 263
602 97
1972 370
89 97
354 2181
341 1905
936 1661
799 2569
291 514
506 105
572 654
306 667
640 565
737 375
1171 260
82 111
277 1055
116 1527
799 328
348 491
496 2699
965 265
433 336
300 292
515 2943
256 2675
267 756
257 452
517 279
2099 289
459 2302
667 291
612 2287
286 275
1011 313
348 303
291 303
477 2673
1502 405
311 460
68 105
728 274
261 2682
348 1676
1317 2460
754 1089
420 377
89 111
116 784
552 97
309 654
529 114
45 44
41 44
297 313
1317 2136
328 106
1730 849
377 523
311 272
342 1311
2822 1791
419 822
339 932
116 279
1841 2740
354 350
1301 321
572 441
1893 108
283 578
1105 114
273 300
100 367
622 2869
311 391
1542 97
806 2341
501 551
1458 639
1190 260
1647 387
266 104
513 603
625 1754
748 263
260 384
517 1134
399 358
1602 671
322 328
116 525
526 312
526 2688
2568 270
286 739
284 117
743 402
275 299
303 460
400 69
2076 292
291 391
2219 1099
1301 406
332 551
718 448
341 350
2298 1417
319 1463
700 276
1230 774
521 263
1526 313
557 117
986 299
736 564
661 2442
743 313
1516 321
105 667
116 361
266 402
1628 436
2521 598
541 101
2782 939
1395 275
834 294
266 1219
326 1861
728 313
1456 499
298 869
1580 2421
711 263
303 384
328 610
116 544
1191 464
556 97
856 121
103 503
318 2401
546 452
2255 1871
680 670
730 274
754 265
931 436
98 715
1942 733
459 2964
1005 97
1165 118
1649 1885
848 295
927 278
2393 2607
83 105
1783 478
282 2088
109 516
263 105
1474 784
99 299
2637 1477
707 101
488 313
195 137
434 2938
324 375
286 1975
559 97
65 110
523 275
541 639
986 314
717 97
291 464
1565 260
1177 606
338 340
65 100
2223 464
2489 850
2474 263
1075 1025
860 2231
448 260
1128 738
2418 763
1249 413
589 377
2471 1343
648 988
799 1099
1573 375
2146 569
1296 369
1073 101
430 475
500 595
105 1318
694 328
100 350
422 275
98 258
77 270
319 333
109 289
807 1613
1728 333
296 2200
114 471
2090 406
1475 427
265 651
326 333
855 262
350 391
456 297
108 300
546 802
490 285
468 464
1760 617
456 272
848 117
354 1004
1158 478
261 351
2166 115
363 278
108 690
99 372
607 295
334 2741
1953 275
1676 276
462 257
477 579
477 311
108 595
559 369
1584 367
2043 2493
34 46
1386 106
258 498
434 115
640 386
1700 914
365 313
430 111
1444 452
1656 110
102 292
118 840
327 103
266 329
1283 275
1484 2955
1247 2861
332 1329
806 829
524 598
32 449
112 321
352 452
2777 115
1125 369
734 97
1588 1419
777 2261
348 648
631 358
268 713
1367 591
306 2249
100 1117
832 351
1950 530
874 272
2942 981
299 340
46 831
116 1117
502 351
1475 263
602 997
313 109
1175 363
476 1476
964 370
2377 682
2152 745
109 392
2574 449
349 97
847 2161
925 260
1103 589
105 461
1126 289
2171 763
742 413
510 1998
1002 587
1710 335
306 351
259 270
306 1754
1877 3062
116 392
1856 278
432 327
282 603
2948 358
332 363
340 587
330 105
258 538
511 381
1449 1142
388 2620
112 621
734 763
359 353
98 323
582 377
115 270
430 303
420 353
391 97
2268 461
348 530
1050 525
563 2092
1942 263
589 518
2604 1911
504 1979
430 829
802 734
279 350
929 2930
668 547
105 313
400 2963
282 2716
98 486
559 101
838 461
341 1199
2009 278
284 3146
382 279
32 316
311 333
325 1759
1269 676
1439 699
276 3298
456 2824
420 327
573 377
325 292
976 300
1364 569
317 840
1522 455
1176 327
1663 512
421 483
63 59
116 798
459 97
581 118
1624 313
2789 314
762 738
2643 1798
101 498
2690 303
520 2133
430 617
2329 2719
965 1461
270 578
99 408
108 687
737 369
340 1498
332 2855
2772 1245
284 1478
2020 3165
256 408
504 1344
1028 705
632 111
662 101
356 664
411 514
2769 3277
101 120
438 829
2156 523
291 1762
99 678
931 466
108 298
3013 2112
418 397
269 1990
566 511
256 547
116 314
65 121
787 358
2547 1848
103 110
658 117
2658 3112
675 3400
422 111
100 425
106 369
653 295
3048 311
1720 699
2048 499
325 265
330 479
397 293
806 272
70 1732
1364 1796
76 97
1751 114
2906 303
2618 1043
717 272
643 433
640 387
109 595
1014 377
1449 2410
2473 280
929 265
267 1419
309 778
380 589
103 405
421 336
98 448
927 450
304 405
1002 1318
847 1476
3082 450
422 516
2940 263
543 461
470 1690
109 314
258 499
1556 1345
348 1789
490 117
388 701
1431 129
281 900
423 2785
563 276
108 279
294 105
318 547
496 272
99 361
67 275
108 635
569 591
949 275
100 503
3139 431
104 2080
108 405
468 3222
105 349
466 258
297 415
794 327
2320 316
283 413
317 1845
273 298
2907 2026
517 647
662 498
388 336
545 330
701 1616
921 351
1357 464
258 386
357 1344
77 105
455 2361
750 641
604 1210
1491 276
298 406
477 1956
541 817
541 973
602 1168
387 861
350 289
441 97
256 372
122 270
105 518
781 369
512 276
270 351
372 260
351 424
105 363
1879 297
1026 101
268 327
311 1061
332 287
341 1734
462 2290
116 363
116 1350
1284 565
779 452
736 300
2356 1223
825 413
3069 311
280 272
274 351
653 1883
104 2288
2508 303
490 265
559 564
2327 471
2110 97
1915 101
422 272
3002 105
935 1137
797 843
99 564
1971 997
109 427
114 531
260 414
787 735
909 454
277 287
799 493
1021 519
2105 579
526 3039
1606 788
1190 882
573 327
1678 727
481 272
485 3321
550 1377
394 274
339 270
268 1291
1752 1447
545 475
742 401
106 335
546 497
490 276
388 1086
1214 2763
496 3339
111 584
112 289
668 375
264 902
263 272
347 97
459 272
390 321
526 292
898 369
1002 464
105 953
515 579
617 101
805 1013
665 324
1640 260
666 114
356 335
257 321
1782 108
1150 313
1296 289
97 613
806 2259
105 483
1967 333
2423 384
430 1184
582 327
762 363
269 278
440 613
281 329
511 1038
103 105
325 1000
742 696
680 610
2110 263
340 667
845 889
668 270
1319 452
866 303
1967 551
866 293
106 723
106 1523
435 906
97 1549
693 461
101 670
1395 272
105 2889
104 265
1847 342
1935 2198
116 531
1166 784
1847 611
325 1123
984 333
1125 270
2826 466
260 260
1075 406
1269 270
305 1725
282 102
653 1998
1005 263
453 276
857 1363
1069 104
117 342
298 335
526 3462
872 1275
1079 323
348 394
266 321
285 626
832 2367
511 313
1902 97
1489 1733
612 1142
98 516
318 3163
477 387
340 1567
1214 3380
1726 647
716 2652
282 413
100 1008
1599 375
317 285
1023 551
312 111
617 1153
2289 1004
422 265
783 260
648 101
631 452
1456 2376
1519 413
343 1067
102 275
992 2434
1252 276
34 44
261 1169
2399 1305
3526 3210
3208 1075
1296 275
928 466
112 350
368 1634
1197 258
480 436
436 111
1465 386
108 677
328 461
866 313
256 299
1032 262
692 97
277 1164
390 452
927 2059
3226 340
265 260
1604 421
2087 307
969 278
2371 427
286 1261
357 2500
99 300
1624 455
559 300
1642 402
1325 466
1841 342
1782 2175
118 2089
715 377
83 117
122 367
300 2775
692 289
332 321
98 314
459 276
265 118
438 342
103 2856
1081 3256
468 1318
725 684
802 263
3267 932
594 429
513 889
623 278
475 361
3471 746
995 265
510 427
1050 1168
523 300
521 342
586 865
261 122
2276 106
1234 843
3184 551
1023 1156
103 739
474 493
318 436
771 918
1390 3275
1739 313
100 564
517 121
658 547
309 112
1266 525
65 613
97 747
330 369
281 297
855 717
2404 503
3510 431
806 263
281 257
1104 584
3230 735
102 270
266 298
441 406
1093 342
1881 105
348 2348
97 598
462 97
264 280
340 336
1191 363
1176 828
275 558
653 466
2363 351
2137 671
2704 3681
273 439
1999 367
109 531
1881 427
1121 313
1439 454
309 2638
380 363
3372 451
103 595
86 105
517 1203
359 289
258 291
1997 732
557 1106
279 538
1514 717
326 885
1150 598
2151 2501
529 370
103 676
1860 3030
122 375
295 122
259 358
500 405
275 321
381 812
3046 361
79 1613
422 2633
98 276
108 358
109 923
86 2917
2880 351
268 624
105 948
2735 3485
3697 1470
105 441
2022 370
559 676
408 303
2465 401
805 619
3132 3706
2626 387
725 275
662 314
100 869
260 745
625 2112
847 274
855 2371
311 291
291 713
325 3458
631 260
261 1332
1716 1133
101 591
572 1134
353 822
550 257
1272 111
681 2641
388 997
388 3514
2368 715
736 369
304 260
1077 761
347 285
373 3051
1834 289
259 323
1230 342
109 369
537 314
261 2842
112 294
80 329
546 3583
309 2593
441 300
318 466
287 350
1834 375
306 565
2140 303
116 294
103 1059
306 2892
2137 647
2266 392
2511 3283
1459 105
1269 739
1563 466
1946 549
101 272
2864 110
1726 671
1418 1284
2148 121
652 3895
100 635
546 115
707 1409
456 3701
325 418
630 3036
297 285
1284 1124
105 436
650 2050
3098 3246
65 78
114 353
848 3401
1923 73
726 375
275 314
2805 303
572 919
3124 391
382 263
1698 2760
3804 358
112 684
506 272
1364 666
823 424
598 100
485 335
3506 925
2823 278
103 101
2985 450
581 2285
65 104
737 1008
412 677
318 571
848 2290
296 3118
648 955
490 402
2991 1015
97 103
2730 852
1427 1348
268 2419
411 292
1009 377
118 279
343 570
295 121
286 411
530 291
105 538
351 406
725 258
261 311
1066 1138
630 761
585 299
1596 454
276 2231
98 263
964 715
121 101
260 416
340 265
318 105
392 272
388 384
297 303
1879 901
111 577
115 713
866 3459
116 374
1201 1348
3640 258
63 751
114 369
1457 538
438 611
936 413
1429 427
3477 291
275 505
1027 564
432 1746
281 411
653 498
456 287
296 982
653 114
1502 263
2561 117
2736 875
3004 342
1500 342
579 427
1170 116
110 2080
32 122
309 1419
947 1927
350 342
546 2518
2654 2628
586 260
2317 454
110 257
305 2311
728 436
1187 289
257 121
387 587
261 371
641 260
2312 327
2482 278
80 597
517 3316
1260 386
423 617
104 382
112 375
258 330
328 122
336 386
1032 535
594 3114
898 2008
101 1025
438 3096
580 2040
281 1987
1860 333
567 278
1683 657
372 3403
545 743
3406 401
285 336
325 448
340 464
322 538
1197 372
108 723
1703 648
1023 121
356 1356
625 671
2783 303
65 930
922 564
418 272
511 328
496 687
848 448
754 105
1647 1827
630 1246
279 340
614 1246
298 1122
1573 97
737 257
1659 285
118 478
1471 294
1488 1417
311 363
537 101
520 293
1283 270
546 867
477 433
475 1200
2577 367
289 114
1688 3502
510 505
807 121
1592 111
306 3632
282 1205
1418 498
419 531
1520 324
617 97
267 1675
514 735
880 1892
1519 633
357 2440
256 503
116 690
348 778
311 439
115 275
2020 2135
1850 374
2146 2260
1983 2728
261 542
348 1921
1265 710
805 370
2771 483
380 633
506 111
1721 591
669 323
986 303
100 257
474 817
298 497
2309 3248
273 329
327 871
381 358
99 321
108 361
1236 696
311 813
304 105
1859 2625
927 598
259 297
77 272
508 861
1954 1548
537 2984
1812 2827
623 298
354 276
665 370
630 2750
1777 498
384 104
604 895
3800 3431
346 1106
2836 411
621 272
2779 1043
105 102
120 3303
572 386
747 900
1201 633
1150 744
309 2010
1893 861
726 97
1222 289
1580 1138
2241 361
2207 401
1023 697
336 728
611 293
403 314
906 377
1366 111
516 4025
98 260
2659 421
359 2486
1272 303
387 111
1586 865
65 3259
329 97
541 1910
506 3365
283 3088
1392 667
3000 483
340 706
423 899
268 1138
261 3034
581 1323
419 867
3507 328
1033 868
306 328
541 560
520 3369
1387 1861
261 313
513 1559
579 314
455 486
517 386
855 413
3228 333
1651 313
297 375
469 560
703 433
557 276
259 684
317 372
473 263
1783 705
1165 1592
388 100
299 3933
271 606
101 106
348 1086
291 1301
500 116
546 914
4211 449
624 336
116 1251
879 289
115 375
2941 303
456 1164
304 471
327 671
2098 289
1556 424
3894 1223
118 1049
1491 263
582 406
1844 464
1155 2052
572 478
2875 1848
2072 499
1896 333
1014 327
285 828
380 377
101 333
1628 1672
273 2726
122 405
1627 2351
419 705
106 841
600 270
440 327
1201 1106
545 97
108 289
116 677
1859 2751
834 486
477 1102
368 639
32 299
1023 333
1743 321
521 464
1580 2031
845 1765
76 111
112 727
2433 1615
1270 313
99 1051
105 3533
260 314
395 1250
778 101
280 358
556 272
3730 413
387 464
117 291
2444 1099
280 260
1564 260
1589 2470
114 478
267 701
436 97
608 391
2037 464
398 486
336 890
365 304
2355 436
2810 2281
298 260
2343 3349
787 321
317 4011
274 405
1289 293
101 843
420 406
276 586
326 285
665 328
3778 1010
434 1136
3320 321
322 577
339 701
556 263
940 101
311 948
1011 436
102 297
991 498
778 370
438 293
2962 370
1182 392
388 565
1307 587
2676 413
527 115
68 919
1249 617
343 639
121 294
1253 285
268 323
297 1250
2555 328
943 1419
804 289
680 116
526 258
115 258
275 498
1397 265
522 3066
622 4036
1149 333
273 449
1529 633
644 1064
1554 552
116 434
285 111
703 519
3901 1144
1922 260
834 2148
286 1049
659 258
508 4144
1472 386
491 761
1649 3434
260 371
497 313
468 1036
1045 111
1096 2439
475 108
3396 356
100 597
468 744
640 1827
835 111
305 1346
2269 111
580 3620
1307 363
388 2950
280 323
388 340
325 349
603 450
297 1332
2048 710
1018 3554
82 101
288 413
3553 439
259 1003
360 295
2742 402
330 270
838 756
1428 97
1067 510
399 425
266 2189
340 744
599 327
341 114
512 635
400 260
433 313
2920 351
1014 406
1424 1792
594 313
1011 466
538 3305
384 278
381 1119
103 514
99 1507
2075 300
3271 358
1642 994
563 2535
625 498
3788 2599
848 297
267 278
995 478
340 765
1347 466
259 397
632 478
347 3944
2753 88
2468 336
522 265
292 100
618 114
1772 76
459 2189
104 536
2588 647
797 1764
108 4080
68 260
469 498
76 263
1454 814
490 4368
735 386
481 375
490 298
267 608
258 1208
3292 391
295 103
477 330
347 958
1620 598
116 1975
109 1655
277 260
291 436
2087 1786
1791 358
324 275
277 675
105 120
350 471
80 2633
625 2440
259 4164
2506 2854
3688 1106
592 536
2377 847
985 313
748 260
4328 2844
112 664
462 2092
2289 763
474 2342
117 1137
802 342
1207 1313
99 690
109 425
1023 1063
108 374
1656 3727
3195 741
104 276
111 1072
474 3638
324 101
3539 424
100 486
545 1102
557 101
1809 1827
318 413
578 544
962 314
614 262
101 304
896 804
258 263
109 279
348 387
109 3261
260 2394
969 263
643 1675
496 65
545 377
855 523
319 598
747 788
511 694
563 1493
799 98
456 274
306 2924
832 603
613 475
350 263
348 285
418 659
103 1434
258 4513
267 383
103 454
4285 2466
3100 304
273 4206
3134 552
1551 358
3426 4281
517 2046
461 327
546 3614
1526 1745
1983 313
431 111
1317 666
1701 1616
112 374
3410 117
259 4042
526 804
3361 1250
794 377
1126 375
598 451
477 1075
3854 696
309 1734
368 321
474 1764
477 694
631 431
726 101
317 270
949 1507
468 598
493 97
545 371
693 260
1439 292
269 829
1502 1981
261 1102
2212 973
1946 1136
594 2004
726 367
468 461
640 104
122 536
863 323
4157 514
1524 1137
311 351
2140 1145
599 454
420 321
520 295
1561 4162
2891 418
105 1064
267 3192
109 367
4432 258
4577 1927
104 270
1327 111
2214 260
517 530
1233 342
3358 439
1133 1462
102 114
3424 404
274 272
122 289
306 3780
799 530
546 370
680 316
336 358
1572 450
1230 278
3552 455
322 260
267 433
1765 667
1249 342
1428 272
667 1005
1906 3841
3695 311
2999 461
1651 303
32 353
372 387
1747 3952
1954 2876
1650 744
2536 471
1969 2595
98 270
286 516
754 531
294 272
2680 313
348 421
286 4214
1068 3494
97 694
480 466
260 1900
372 353
1679 4626
550 117
446 2993
1509 1910
388 2599
275 293
1554 335
1681 2759
350 401
343 414
266 1457
332 387
1366 313
382 260
288 401
101 342
630 1063
276 293
83 274
1483 621
2335 3522
3837 4221
781 275
2088 285
266 260
112 270
288 590
618 1217
299 292
256 544
491 499
456 687
79 78
272 97
332 102
2862 406
572 1833
1001 460
2778 311
111 98
585 314
456 323
496 1003
851 105
110 3468
1744 367
285 562
524 746
32 448
816 358
567 4473
602 275
628 1839
604 1413
921 493
267 2832
286 314
115 1806
3448 4427
1428 263
76 101
880 441
2866 745
965 531
4628 2040
1159 431
501 1156
420 2263
408 313
380 101
103 547
103 361
513 1711
848 97
987 664
797 351
1601 299
625 1441
319 316
339 919
488 3516
3824 406
455 97
2669 765
634 817
266 1964
2536 2419
332 948
264 275
1915 1402
517 112
377 97
1824 1567
266 812
537 272
602 1570
356 475
787 895
1234 3385
845 1198
1035 293
97 2911
701 1690
347 720
332 406
1905 115
658 270
266 516
269 549
940 405
115 313
388 3975
1222 369
4732 2685
2572 101
438 3582
3953 4514
1139 195
485 812
1518 4553
318 1749
311 1004
2693 2766
3405 313
360 1138
102 2959
2626 4467
1741 1136
256 1567
666 263
1649 1156
99 516
2707 454
1028 478
2619 2484
1224 1682
832 98
297 102
313 293
76 272
345 122
332 664
1893 1512
1471 689
97 122
348 272
825 3920
3346 272
1301 358
1283 597
453 258
114 276
115 958
1551 1331
431 97
296 100
260 441
1427 303
1410 299
114 312
259 1848
640 1311
108 2854
271 101
1427 1250
883 274
348 2911
563 2914
618 952
883 257
2083 493
311 336
328 1378
435 285
359 258
98 814
3675 745
105 4247
397 278
3986 370
3164 427
3302 2136
2840 335
2156 885
4645 2645
1872 2939
381 270
297 323
286 280
563 4331
408 436
419 1053
265 1746
539 478
1155 923
963 2677
269 3432
280 297
522 363
32 570
893 263
3924 1098
348 562
2693 525
526 434
2433 696
707 265
388 1246
4101 275
1448 260
341 715
826 1048
520 448
325 372
1325 303
340 2055
4398 491
1978 369
306 655
621 263
261 633
583 103
2037 587
3794 114
99 1291
662 531
456 275
2098 114
692 375
2272 1117
4183 788
2262 3047
883 287
4529 1987
2171 439
326 536
273 2914
111 591
1355 2010
734 2004
348 411
340 455
4104 3855
880 313
380 115
297 115
628 701
747 111
3370 512
420 705
1222 547
825 4273
541 293
102 631
545 102
1995 263
490 1477
1053 313
474 105
112 639
3990 363
348 1396
80 275
341 2052
550 258
987 1914
2312 518
2396 303
274 335
343 817
100 1493
497 278
122 336
2338 493
539 1282
97 916
947 4481
360 394
282 1739
318 4136
965 3025
261 3950
282 3478
546 377
476 1061
2212 2213
72 287
317 4740
2714 1180
632 260
787 3126
440 1346
611 406
100 300
3752 97
935 514
267 327
350 1725
323 745
109 869
806 314
2476 404
539 639
4205 294
77 402
4620 746
1679 439
4819 314
481 275
754 4933
318 328
2654 875
845 483
83 285
66 322
2825 497
272 293
3141 1064
460 258
1362 4433
522 335
602 1831
1688 771
703 497
4409 544
110 1261
319 1000
569 466
513 2043
1283 97
299 4117
306 510
2166 351
309 98
318 272
377 626
108 297
2572 270
617 111
2590 1164
1872 1302
810 4353
455 771
325 3877
104 312
260 436
711 111
339 1878
1297 1075
3718 3504
3347 511
622 2623
2968 117
2588 774
1484 371
322 313
1030 300
3556 421
103 298
355 1939
3599 263
343 258
99 483
500 676
315 667
388 99
328 852
438 1816
86 531
779 431
3026 303
109 1305
387 97
1896 1345
286 299
97 3171
98 684
1943 335
296 272
2928 1363
303 342
572 303
1347 313
567 109
97 1789
1954 598
348 111
105 497
580 272
296 401
3057 765
269 328
2143 1314
2009 1152
539 1329
1355 303
306 3525
490 4512
1519 441
567 122
5026 1979
300 406
84 69
3454 741
114 287
325 4161
1149 101
291 569
261 3007
326 103
2062 552
355 562
559 270
415 342
2333 452
2758 275
381 97
2571 109
2000 1911
737 676
585 293
1999 812
3236 313
286 260
1751 289
1197 265
502 358
277 571
816 313
1610 4828
832 1958
754 402
98 427
325 327
1233 114
115 300
352 358
1297 3180
398 101
33 751
4918 621
5067 427
282 3116
1458 328
1258 471
99 335
275 822
641 97
350 100
1804 906
83 101
798 2161
779 321
935 404
641 313
423 4266
879 405
117 321
397 111
114 335
2363 99
795 552
268 518
481 263
256 1251
860 1213
323 313
105 1911
340 97
2238 375
3480 1684
823 867
3090 278
543 617
634 2557
99 705
1844 587
3027 3790
2670 409
122 723
736 841
1535 595
577 101
608 272
618 2712
1465 409
3562 1314
114 434
4239 372
1105 289
110 405
343 2639
703 3537
2345 100
109 723
969 1086
848 111
340 383
261 2832
3068 300
3177 2671
578 425
282 1323
114 705
258 406
4143 552
4662 391
511 569
485 2071
325 3411
4045 4804
630 2201
3019 405
799 303
103 339
634 1880
318 4922
625 4600
1860 1958
346 1409
317 516
1962 293
2739 4884
3345 551
5114 4676
106 564
2272 4265
399 478
3018 275
3334 1734
496 88
115 257
261 3466
1268 3388
628 1798
282 1266
1429 882
1889 386
1192 377
1698 519
347 297
4201 710
388 1106
1480 466
1179 670
4013 1548
1207 303
828 260
541 1417
787 311
1584 289
827 4486
398 292
348 545
332 1063
703 311
4461 579
355 262
943 436
106 552
1161 436
1844 363
295 351
3772 1314
297 289
526 276
1390 327
324 3193
2837 303
112 713
2561 439
355 112
112 322
1872 4805
343 696
517 1335
4374 1240
296 342
110 1194
106 374
3725 699
1297 102
286 902
32 300
76 687
860 418
2829 902
529 2201
350 262
468 1323
3898 3390
435 571
423 867
4942 404
2035 803
2474 272
1018 715
3384 263
477 1641
1974 100
572 1032
400 117
77 285
1577 828
266 675
895 98
305 4225
2498 621
351 112
948 313
328 1209
1410 387
269 2107
1150 560
500 547
1524 3035
266 1314
387 948
2054 1672
388 808
537 323
541 498
539 258
279 383
3176 275
291 439
2396 313
410 4451
655 451
